Tekla.Structures.Datatype.DistanceList
A list of Tekla.Structures.Datatype.Distance instances.
Remarks:
Tekla.Structures.Datatype.DistanceLists are used to store related Tekla.Structures.Datatype.Distance instances
in an enumerable, formattable list.

Tekla.Structures.Datatype.DistanceList.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Datatype.Distance})
Initializes a new instance of the structure.
distanceList: The distance list.
This example shows how to construct an empty Tekla.Structures.Datatype.DistanceList instance
as well as a Tekla.Structures.Datatype.DistanceList instance from an existing enumerable
collection of Tekla.Structures.Datatype.Distance instances. A copy of the collection
is created, modifying the original collection does not affect
the constructed Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// By default the constructor creates an empty list.
DistanceList defaultList = new DistanceList();
// Distance list can also be constructed from an array (or any other
// enumerable collection) of Distance instances.
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
// Distance lists created this way contain a copy of the source collection.
// Modifying the original collection does not affect the constructed list.
DistanceList distanceList = new DistanceList(distances);
distanceList = defaultList;
}
}

Tekla.Structures.Datatype.DistanceList.Parse(System.String)
Parses a distance list from a string representation.
input: The input string.
Returns: The distance list.
This example shows how to parse distance lists with the current culture information
and the current unit type.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in parsing.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// By default, the parsing uses the current unit type and the current culture info.
// This will be parsed as 3 millimeters and 2 millimeters.
DistanceList defaultFormat = DistanceList.Parse("3 2");
}
}

Tekla.Structures.Datatype.DistanceList.Parse(System.String,System.IFormatProvider)
Parses a distance list from a string representation.
input: The input string.
formatProvider: The format provider.
Returns: The distance list.
This example shows how to override the format provider when parsing distance
lists. The Tekla Structures convention is to use a dot as the decimal separator
in all locales.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in parsing.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// Tekla Structures uses dot as the decimal separator in all locales.
// This will be parsed as 3 times 30.2 millimeters.
DistanceList TeklaStructuresFormat = DistanceList.Parse("3*30.2", CultureInfo.InvariantCulture);
// If the distance contains the unit, the distances are converted automatically.
// This will be parsed as 3 times 30.2 meters.
DistanceList distancesInMeters = DistanceList.Parse("3*30.2m", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.DistanceList.Parse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Parses a distance list from a string representation.
input: The input string.
formatProvider: The format provider.
defaultUnitType: The default unit type.
Returns: The distance list.
This example shows how to override both the format provider and the unit type
when parsing distance lists.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in parsing.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// We can override the current unit type to force the parsing to perform automatic unit conversion.
// This will be parsed as 3 times 3.2 inches.
DistanceList distanceInInches = DistanceList.Parse("3*3.2", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
// When using feet or inches as the distance unit, the fractional format is supported as well.
// This will be parsed as 3 times 3/4 inches.
DistanceList inchesInFractionalFormat = DistanceList.Parse("3*3/4", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
// When a distance list is used in a plug-in dialog, the dialog attribute is passed to the plug-in execution as a string.
// Distance values are then parsed from the string using InvariantCulture and Millimeter.
DistanceList distancesInPluginRun = DistanceList.Parse("3*40.00 50.00", CultureInfo.InvariantCulture, Distance.UnitType.Millimeter);
}
}

Tekla.Structures.Datatype.DistanceList.ToString
Returns the string representation of the distance list.
Returns: The string representation of the distance list.
This example shows how to format a Tekla.Structures.Datatype.DistanceList with the current
culture information and the current unit type.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in formatting.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// UseFractionalFormat controls whether the feet and inches are formatted
// using the fractional representation. The default value is false which
// causes the feet and inches to be represented as decimal numbers.
Distance.UseFractionalFormat = false;
// UseUnitsInDecimalString controls whether the unit type is shown in the
// decimal string representation. The default is false.
Distance.UseUnitsInDecimalString = false;
// We'll use this distance list to demonstrate the formatting.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
// The default format uses the current unit type, current culture info and
// the default number format.
string defaultFormat = distanceList.ToString();
}
}

Tekla.Structures.Datatype.DistanceList.ToString(System.IFormatProvider)
Returns the string representation of the distance list.
formatProvider: The format provider.
Returns: The string representation of the distance list.
This example shows how to override the format provider
when formatting a Tekla.Structures.Datatype.DistanceList instance.
The Tekla Structures convention is to use a dot as the decimal separator in all locales.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in formatting.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// UseFractionalFormat controls whether the feet and inches are formatted
// using the fractional representation. The default value is false which
// causes the feet and inches to be represented as decimal numbers.
Distance.UseFractionalFormat = false;
// UseUnitsInDecimalString controls whether the unit type is shown in the
// decimal string representation. The default is false.
Distance.UseUnitsInDecimalString = false;
// We'll use this distance list to demonstrate the formatting.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
// Tekla Structures uses dot as the decimal separator in all locales.
string TeklaStructuresFormat = distanceList.ToString(null, CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.DistanceList.ToString(System.String,System.IFormatProvider)
Returns the string representation of the distance list.
format: The format string.
formatProvider: The format provider.
Returns: The string representation of the distance list.
This example shows how to override the number format and the format provider
when formatting a Tekla.Structures.Datatype.DistanceList instance. The Tekla Structures
convention is to use a dot as the decimal separator in all locales.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in formatting.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// UseFractionalFormat controls whether the feet and inches are formatted
// using the fractional representation. The default value is false which
// causes the feet and inches to be represented as decimal numbers.
Distance.UseFractionalFormat = false;
// UseUnitsInDecimalString controls whether the unit type is shown in the
// decimal string representation. The default is false.
Distance.UseUnitsInDecimalString = false;
// We'll use this distance list to demonstrate the formatting.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
// Tekla Structures uses dot as the decimal separator in all locales.
string TeklaStructuresFormat = distanceList.ToString(null, CultureInfo.InvariantCulture);
// We can use the number format string to specify the precision. In this case, we use two decimal places.
string TeklaStructuresFormatWithPrecicion = distanceList.ToString("0.00", CultureInfo.InvariantCulture);
}
}

Tekla.Structures.Datatype.DistanceList.ToString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Distance.UnitType)
Returns the string representation of the distance list.
format: The format string.
formatProvider: The format provider.
unitType: The distance unit type.
Returns: The string representation of the distance list.
This example shows how to override the number format, the format provider and
the unit type when formatting a Tekla.Structures.Datatype.DistanceList instance.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
public void Example1()
{
// Current unit type controls the default unit type used in formatting.
// The default unit is millimeter.
Distance.CurrentUnitType = Distance.UnitType.Millimeter;
// UseFractionalFormat controls whether the feet and inches are formatted
// using the fractional representation. The default value is false which
// causes the feet and inches to be represented as decimal numbers.
Distance.UseFractionalFormat = false;
// UseUnitsInDecimalString controls whether the unit type is shown in the
// decimal string representation. The default is false.
Distance.UseUnitsInDecimalString = false;
// We'll use this distance list to demonstrate the formatting.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
// We can override the unit type to display the distances in inches.
string defaultFormatInInches = distanceList.ToString(null, null, Distance.UnitType.Inch);
// We can also combine the above with the number format and culture info to get fully customized representation.
string TeklaStructuresFormatWithPrecicionInInches = distanceList.ToString("0.00", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
}
}

Tekla.Structures.Datatype.DistanceList.Add(Tekla.Structures.Datatype.Distance)
Adds the specified item at the end of the list.
item: The item to be added.
This example shows how to add a new Tekla.Structures.Datatype.Distance instance at the
end of the Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
// New distances can be added to the list using the DistanceList.Add method.
distanceList.Add(new Distance(2));
distanceList.Add(new Distance(40, Distance.UnitType.Inch));
}
}

Tekla.Structures.Datatype.DistanceList.Clear
Clears the list.
This example shows how to remove all items from a Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
// The whole list can be cleared with DistanceList.Clear method.
distanceList.Clear();
}
}

Tekla.Structures.Datatype.DistanceList.Contains(Tekla.Structures.Datatype.Distance)
Determines whether the specified item is in the list.
item: The item to be matched.
Returns: A boolean value indicating whether the item was found.
This example shows how to determine whether the specified Tekla.Structures.Datatype.Distance
instance is contained in a Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// We'll use this distance list to demonstrate the Contains method.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
bool isInList = distanceList.Contains(new Distance(50));
}
}

Tekla.Structures.Datatype.DistanceList.CopyTo(Tekla.Structures.Datatype.Distance[],System.Int32)
Copies the contents of the list to an array.
array: The target array.
arrayIndex: The starting index in the array.
This example shows how to copy the Tekla.Structures.Datatype.Distance instances in a
Tekla.Structures.Datatype.DistanceList to an array.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// We'll use this distance list to demonstrate the CopyTo method.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
Distance[] array = new Distance[distanceList.Count];
distanceList.CopyTo(array, 0);
}
}

Tekla.Structures.Datatype.DistanceList.Remove(Tekla.Structures.Datatype.Distance)
Removes the specified item.
item: The item to be removed.
Returns: A boolean value indicating whether the item was removed.
This example shows how to remove a Tekla.Structures.Datatype.Distance instance from a
Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(40, Distance.UnitType.Inch) };
DistanceList distanceList = new DistanceList(distances);
// Distances can be removed by value. The first matching distance will be removed.
bool removed = distanceList.Remove(new Distance(40, Distance.UnitType.Inch));
}
}

Tekla.Structures.Datatype.DistanceList.IndexOf(Tekla.Structures.Datatype.Distance)
Returns the index of the first matching item in the list.
item: The item to be matched.
Returns: The index of the first matching item.
This example shows how to determine the index of the first matching
Tekla.Structures.Datatype.Distance instance in a Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// We'll use this distance list to demonstrate the IndexOf method.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
int index = distanceList.IndexOf(new Distance(2));
if(index < 0)
{
// Not found.
}
else
{
// Found, do something with the index.
}
}
}

Tekla.Structures.Datatype.DistanceList.Insert(System.Int32,Tekla.Structures.Datatype.Distance)
Inserts an item at the specified position.
index: The index of the insertion point.
item: The item to be inserted.
This example shows how to insert a new Tekla.Structures.Datatype.Distance instance at the
beginning of the Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
distanceList.Insert(0, new Distance(2));
}
}

Tekla.Structures.Datatype.DistanceList.RemoveAt(System.Int32)
Removes an item at the specified position.
index: The index of the item to be removed.
This example shows how to remove a Tekla.Structures.Datatype.Distance instance from the
beginning of a Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
// Distance can be removed at any position using the DistanceList.RemoveAt method.
distanceList.RemoveAt(1);
}
}

Tekla.Structures.Datatype.DistanceList.ToArray
Copies the contents of the list into a new array.
Returns: The array of distances.
This example shows how to copy the Tekla.Structures.Datatype.Distance instances in a
Tekla.Structures.Datatype.DistanceList to a new array.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
// We can copy the list contents to a new array. This allows us to
// enumerate the contents even if the list changes during the enumeration.
Distance[] distancesInArray = distanceList.ToArray();
foreach(Distance distance in distancesInArray)
{
string formattedDistance = distance.ToString();
}
}
}

Tekla.Structures.Datatype.DistanceList.GetEnumerator
Gets an enumerator for enumeraring through the list.
Returns: The list enumerator.
This example shows how to enumerate the Tekla.Structures.Datatype.Distance instances in a
Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
Distance[] distances = { new Distance(30.2), new Distance(2.3) };
DistanceList distanceList = new DistanceList(distances);
// In this example, GetEnumerator is not explicitly called,
// but it is implemented to support the use of foreach.
foreach(Distance distance in distanceList)
{
string formattedDistance = distance.ToString();
}
// Indexed access is also supported. This allows the list to be enumerated in
// any order required.
for(int i = 0; i < distanceList.Count; i++)
{
string formattedDistance = distanceList[i].ToString();
}
}
}

Tekla.Structures.Datatype.DistanceList.System#Collections#IEnumerable#GetEnumerator
Gets an enumerator for enumeraring through the list.
Returns: The list enumerator.
Remarks:
This method is implemented explicitly for legacy compatibility.

Tekla.Structures.Datatype.DistanceList.Item(System.Int32)
Gets or sets the item at the specified index.
index: The index of an item in the list.
Returns: The item at the specified index.
This example shows how to access the Tekla.Structures.Datatype.Distance instances in a
Tekla.Structures.Datatype.DistanceList by index.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// We'll use this distance list to demonstrate how to access and then
// modify items using an index.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
for(int i = 0; i < distanceList.Count; i++)
{
Distance item = distanceList[i];
// Modify the item here.
distanceList[i] = item;
}
}
}

Tekla.Structures.Datatype.DistanceList.Count
Gets the number of items in the list.
Number of items in the list.
This example shows how the get the number of Tekla.Structures.Datatype.Distance instances
in a Tekla.Structures.Datatype.DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
public void Example1()
{
// We'll use this distance list to demonstrate the Count property.
DistanceList distanceList = new DistanceList(new Distance[]
{
new Distance(30.2),
new Distance(30.2),
new Distance(30.2),
new Distance(50),
new Distance(2.3),
new Distance(2.3),
});
int distanceCount = distanceList.Count;
}
}

Tekla.Structures.Datatype.DistanceList.IsReadOnly
Gets a boolean value indicating whether the collection is read-only.
A boolean value indicating whether the collection is read-only.
Remarks:
Tekla.Structures.Datatype.DistanceLists are always mutable.

Tekla.Structures.Datatype.DistanceList.Distances
Gets the list of Tekla.Structures.Datatype.Distances.
Underlying list of Tekla.Structures.Datatype.Distance instances.
Remarks:
This property is used to initialize the Tekla.Structures.Datatype.DistanceList.distances field in case
the Tekla.Structures.Datatype.DistanceList was created with the default constructor. This
is one side-effect of implementing the Tekla.Structures.Datatype.DistanceList as a struct
instead of a class.

Tekla.Structures.Datatype.DistanceList.distances
List of Tekla.Structures.Datatype.Distances.

Tekla.Structures.Datatype.DistanceList.GetSchema


Tekla.Structures.Datatype.DistanceList.ReadXml(System.Xml.XmlReader)


Tekla.Structures.Datatype.DistanceList.WriteXml(System.Xml.XmlWriter)
